src/cf/src/Documents/ЗаказПокупателя/ЗаказПокупателя.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаказПокупателя</name>
  <basedOn>Document.РеализацияТоваровУслуг</basedOn>
  <posting>Allow</posting>
  <registerRecords>AccumulationRegister.ПотребностиПроизводства</registerRecords>
  <attributes>
    <name>ДатаОтгрузки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыСКонтрагентами</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>DefinedType.Комментарий</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Менеджер</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>DefinedType.СуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаНДС</name>
    <type>
      <types>DefinedType.СуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаБезНДС</name>
    <type>
      <types>DefinedType.СуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦенаВключаетНДС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
      <types>DocumentRef.КоммерческоеПредложение</types>
    </type>
  </attributes>
  <attributes>
    <name>ECommerce</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Доставлен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерВходящегоДокументаЭлектронногоОбмена</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗаказСWEBСайта</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВходящегоДокументаЭлектронногоОбмена</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>МенеджерПодтвердилПроверилОстаток</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.ВидыОперацийЗаказаПокупателя</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТЧТовары</name>
    <attributes>
      <name>КодСтроки</name>
      <type>
        <types>DefinedType.КодСтроки</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>НоменклатураСтрока</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <type>
        <types>DefinedType.КоличествоНеотрицательное</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>DefinedType.КоличествоНеотрицательное</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидЦены</name>
      <type>
        <types>CatalogRef.ВидыЦен</types>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаSKU</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>ПроцентСкидки</name>
      <type>
        <types>DefinedType.ПроцентСкидки</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаСкидки</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаСНДС</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>CatalogRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СкидкаНаЦену</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>Техкарта</name>
      <type>
        <types>DocumentRef.ТехнологическаяКарта</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТЧМатериалы</name>
    <attributes>
      <name>КодСтроки</name>
      <type>
        <types>DefinedType.КодСтроки</types>
      </type>
    </attributes>
    <attributes>
      <name>КодСтрокиПродукции</name>
      <type>
        <types>DefinedType.КодСтроки</types>
      </type>
    </attributes>
    <attributes>
      <name>КодСтрокиРодителя</name>
      <type>
        <types>DefinedType.КодСтроки</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоЗаЕдиницу</name>
      <type>
        <types>DefinedType.Количество</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <type>
        <types>DefinedType.КоличествоНеотрицательное</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>DefinedType.КоличествоНеотрицательное</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>DefinedType.Комментарий</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/cf/src/InformationRegisters/ДополнительныеСведенияНоменклатуры/ДополнительныеСведенияНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ДополнительныеСведенияНоменклатуры</name>
  <resources>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/cf/src/Enums/ВидыОперацийЗаказаПокупателя/ВидыОперацийЗаказаПокупателя.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыОперацийЗаказаПокупателя</name>
  <enumValues>
    <name>Продажа</name>
  </enumValues>
  <enumValues>
    <name>Производство</name>
  </enumValues>
</mdclass:Enum>

src/cf/src/Enums/СпособыПополненияЗапасов/СпособыПополненияЗапасов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СпособыПополненияЗапасов</name>
  <enumValues>
    <name>Закупка</name>
  </enumValues>
  <enumValues>
    <name>Производство</name>
  </enumValues>
  <enumValues>
    <name>Оба</name>
  </enumValues>
</mdclass:Enum>

src/cf/src/Documents/ТехнологическаяКарта/ТехнологическаяКарта.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ТехнологическаяКарта</name>
  <registerRecords>InformationRegister.СоставТехКарты</registerRecords>
  <attributes>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>DefinedType.Комментарий</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТЧМатериалы</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>DefinedType.НормаРасхода</types>
      </type>
    </attributes>
    <attributes>
      <name>СпособИзготовления</name>
      <type>
        <types>EnumRef.СпособыИзготовления</types>
      </type>
    </attributes>
    <attributes>
      <name>ПроцентПотерь</name>
      <type>
        <types>DefinedType.Процент</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/cf/src/Catalogs/ДоговорыСКонтрагентами/ДоговорыСКонтрагентами.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ДоговорыСКонтрагентами</name>
  <attributes>
    <name>БанковскийСчёт</name>
    <type>
      <types>CatalogRef.БанковскиеСчета</types>
    </type>
  </attributes>
  <attributes>
    <name>БанковскийСчётКонтрагента</name>
    <type>
      <types>CatalogRef.БанковскиеСчета</types>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаВзаиморасчётов</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДоговора</name>
    <type>
      <types>EnumRef.ВидыДоговоров</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидЦены</name>
    <type>
      <types>CatalogRef.ВидыЦен</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаДоговора</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>НачалоДействия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОкончаниеДействия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>DefinedType.Комментарий</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Основной</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РасчётыВУсловныхЕдиницах</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособРасчётаОтсрочки</name>
    <type>
      <types>EnumRef.СпособыРасчётаОтсрочки</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокОплаты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыДоговоровКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаКредита</name>
    <type>
      <types>DefinedType.СуммаНеотрицательная</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/cf/src/Catalogs/УпаковкиЕдиницыИзмерения/УпаковкиЕдиницыИзмерения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>УпаковкиЕдиницыИзмерения</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <attributes>
    <name>Единица</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>Знаменатель</name>
    <type>
      <types>DefinedType.КоличествоДолей</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоУпаковок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МеждународноеСокращение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <comment>Полное наименование, например, для печати</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипИзмеряемойВеличины</name>
    <type>
      <types>EnumRef.ТипыИзмеряемыхВеличин</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипУпаковки</name>
    <type>
      <types>EnumRef.ТипыУпаковокНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>Числитель</name>
    <type>
      <types>DefinedType.КоличествоДолей</types>
    </type>
  </attributes>
  <attributes>
    <name>Вес</name>
    <comment>Вес брутто</comment>
    <type>
      <types>DefinedType.КоличествоДолей</types>
    </type>
  </attributes>
  <attributes>
    <name>ВесЕдиница</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>Высота</name>
    <type>
      <types>DefinedType.КоличествоДолей</types>
    </type>
  </attributes>
  <attributes>
    <name>ВысотаЕдиница</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>Глубина</name>
    <type>
      <types>DefinedType.КоличествоДолей</types>
    </type>
  </attributes>
  <attributes>
    <name>ГлубинаЕдиница</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>Ширина</name>
    <type>
      <types>DefinedType.КоличествоДолей</types>
    </type>
  </attributes>
  <attributes>
    <name>ШиринаЕдиница</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/cf/src/Documents/ЗаказПокупателя/ManagerModule.bsl
#Область ПрограммныйИнтерфейс

// Перечисляет печатные формы документа.
// См. ПечатныеФормы.НоваяКоллекцияКомандПечати
//
// Параметры:
//  КомандыПечати - ТаблицаЗначений - пополняемая коллекция команд печати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт

	Для Каждого Описание Из ОписанияПечатныхФорм() Цикл
		Команда = КомандыПечати.Добавить();
		Команда.ИмяМакета = Описание.ИмяМакета;
		Команда.Представление = Описание.Представление;
	КонецЦикла;

КонецПроцедуры

// Формирует запрошенные печатные формы документа.
// См. ПечатныеФормы.СформироватьПечатныеФормы
//
// Параметры:
//  МассивОбъектов        - Массив          - печатаемые документы
//  ПараметрыПечати       - Структура       - параметры команды печати
//  КоллекцияПечатныхФорм - ТаблицаЗначений - заполняемая коллекция печатных форм
//  ОбъектыПечати         - СписокЗначений  - соответствие документов областям печати
//  ПараметрыВывода       - Структура       - параметры окна печати
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт

	Для Каждого Описание Из ОписанияПечатныхФорм() Цикл
		Если Не ПечатныеФормы.НужноПечататьМакет(КоллекцияПечатныхФорм, Описание.ИмяМакета) Тогда
			Продолжить;
		КонецЕсли;

		Таб = Новый ТабличныйДокумент;
		Для Каждого Док Из МассивОбъектов Цикл
			НомерСтрокиНачало = Таб.ВысотаТаблицы + 1;
			ВывестиПечатнуюФорму(Описание.ИмяМакета, Док, Таб);
			ПечатныеФормы.ЗадатьОбластьПечати(Таб, НомерСтрокиНачало, ОбъектыПечати, Док);
		КонецЦикла;

		ПечатныеФормы.ВывестиТабличныйДокумент(КоллекцияПечатныхФорм, Описание.ИмяМакета,
			Описание.Представление, Таб, Описание.ПутьКМакету);
	КонецЦикла;

КонецПроцедуры

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

// Ставит новый код строкам товаров с нулевым кодом или с кодом, повторяющим код более ранней
// строки: по коду строки товаров к ней привязаны материалы заказа на производство. Штрихкод
// кода не ставит, а заполнение по основанию копирует коды основания.
// Работает и с табличной частью объекта, и с данными формы.
//
// Параметры:
//  ТЧТовары - ТабличнаяЧасть, ДанныеФормыКоллекция - товары заказа.
//  Строки   - Массив, Неопределено - проверяемые строки товаров; не задано - все строки.
//
// Возвращаемое значение:
//  Булево - Истина, если хотя бы один код изменён.
//
Функция ОбеспечитьКодыСтрокТоваров(ТЧТовары, Строки = Неопределено) Экспорт

	ПроверяемыеИндексы = Неопределено;
	Если Строки <> Неопределено Тогда
		ПроверяемыеИндексы = Новый Соответствие;
		Для Каждого СтрокаТоваров Из Строки Цикл
			ПроверяемыеИндексы.Вставить(ТЧТовары.Индекс(СтрокаТоваров), Истина);
		КонецЦикла;
	КонецЕсли;
	МаксимальныйКод = 0;
	Для Каждого СтрокаТоваров Из ТЧТовары Цикл
		МаксимальныйКод = Макс(МаксимальныйКод, СтрокаТоваров.КодСтроки);
	КонецЦикла;
	ВстреченныеКоды = Новый Соответствие;
	Изменено = Ложь;
	Для Индекс = 0 По ТЧТовары.Количество() - 1 Цикл
		СтрокаТоваров = ТЧТовары[Индекс];
		Проверять = ПроверяемыеИндексы = Неопределено Или ПроверяемыеИндексы[Индекс] <> Неопределено;
		КодЗанят = СтрокаТоваров.КодСтроки = 0 Или ВстреченныеКоды[СтрокаТоваров.КодСтроки] <> Неопределено;
		Если Проверять И КодЗанят Тогда
			МаксимальныйКод = МаксимальныйКод + 1;
			СтрокаТоваров.КодСтроки = МаксимальныйКод;
			Изменено = Истина;
		КонецЕсли;
		ВстреченныеКоды.Вставить(СтрокаТоваров.КодСтроки, Истина);
	КонецЦикла;
	Возврат Изменено;

КонецФункции

// Заполняет материалы строк товаров заказа на производство по технологическим картам,
// действующим на дату заказа. Карта разворачивается в глубину: продукция -> полуфабрикат ->
// материалы, связь узла с родителем хранится в КодСтрокиРодителя (у первого уровня он нулевой).
// Прежние материалы заполняемой строки заменяются целиком, вместе с поддеревом; колонка
// «Техкарта» строки получает версию карты ПЕРВОГО уровня (её регистратор) - карту самой продукции,
// именно её сверяет и перезаписывает проведение заказа. У позиции без карты колонка очищается.
// Общая часть команды формы и заполнения заказа по коммерческому предложению: работает с
// коллекциями строк, поэтому форма не гоняет объект целиком и не теряет дополнительные колонки.
//
// Параметры:
//  ТЧТовары     - ТабличнаяЧасть, ДанныеФормыКоллекция - товары заказа.
//  ТЧМатериалы  - ТабличнаяЧасть, ДанныеФормыКоллекция - материалы заказа.
//  Дата         - Дата - момент среза карт; не заполнена - дата сеанса.
//  Строки       - Массив, Неопределено - заполняемые строки товаров; не задано - все строки
//                 с заполненной номенклатурой.
//  СообщатьТолькоПроизводимые - Булево - о позиции без карты сообщать, только если она пополняется
//                 производством: закупаемый товар в заказе на производство карты не требует.
//  КлючДанных   - ДокументОбъект.ЗаказПокупателя, Неопределено - объект для привязки сообщений;
//                 не задан - сообщения привязываются к реквизиту формы «Объект».
//
// Возвращаемое значение:
//  Структура - итог заполнения:
//   * Заполнено  - Число - сколько строк товаров получили материалы по карте.
//   * БезКарты   - Массив из СправочникСсылка.Номенклатура - позиции без карты, о которых сообщено.
//   * СОшибками  - Массив из СправочникСсылка.Номенклатура - позиции, чью карту не удалось развернуть
//                  (цикл или превышение глубины): их материалы очищены, сообщение выведено.
//
Функция ЗаполнитьМатериалыПоТехкартам(ТЧТовары, ТЧМатериалы, Дата, Строки = Неопределено,
	СообщатьТолькоПроизводимые = Ложь, КлючДанных = Неопределено) Экспорт

	Результат = Новый Структура("Заполнено, БезКарты, СОшибками", 0, Новый Массив, Новый Массив);
	Заполняемые = Новый Массив;
	Продукция = Новый Массив;
	Для Каждого СтрокаТоваров Из ?(Строки = Неопределено, ТЧТовары, Строки) Цикл
		Если Не ЗначениеЗаполнено(СтрокаТоваров.Номенклатура) Тогда
			Продолжить;
		КонецЕсли;
		Заполняемые.Добавить(СтрокаТоваров);
		Если Продукция.Найти(СтрокаТоваров.Номенклатура) = Неопределено Тогда
			Продукция.Добавить(СтрокаТоваров.Номенклатура);
		КонецЕсли;
	КонецЦикла;
	Если Продукция.Количество() = 0 Тогда
		Возврат Результат;
	КонецЕсли;

	// Без опции упаковка в документ не уходит, как у заполнения выпуска (решение владельца 2026-09-10):
	// её же учитывает разворачивание, когда перемножает количества по цепочке.
	СУпаковкой = ПолучитьФункциональнуюОпцию("ИспользоватьУпаковку");
	Развернутый = ТехнологическиеКарты.РазвернутыйСостав(Продукция, Дата, СУпаковкой);
	Состав = Развернутый.Строки;
	ПродукцияСОшибками = ПродукцияОшибокРазворачивания(Развернутый.Ошибки);
	СКартой = Новый Массив;
	БезКарты = Новый Массив;
	СОшибками = Новый Массив;
	Для Каждого СтрокаТоваров Из Заполняемые Цикл
		Если ПродукцияСОшибками[СтрокаТоваров.Номенклатура] <> Неопределено Тогда
			// Карта развернулась не до конца: заполнять дерево по обрезанной цепочке нельзя - потребность
			// вышла бы заведомо неверной. Строка остаётся без материалов, как позиция без карты.
			СОшибками.Добавить(СтрокаТоваров);
		ИначеЕсли Состав.НайтиСтроки(Новый Структура("Продукция", СтрокаТоваров.Номенклатура)).Количество() = 0 Тогда
			БезКарты.Добавить(СтрокаТоваров);
		Иначе
			СКартой.Добавить(СтрокаТоваров);
		КонецЕсли;
	КонецЦикла;
	// Код нужен только строкам, получающим материалы: коды остальных строк не трогаются, по ним
	// реализация перезаполняет цены из заказа-основания.
	ОбеспечитьКодыСтрокТоваров(ТЧТовары, СКартой);
	ОчиститьСтрокиБезКарты(ТЧТовары, ТЧМатериалы, БезКарты);
	ОчиститьСтрокиБезКарты(ТЧТовары, ТЧМатериалы, СОшибками);
	Для Каждого СтрокаТоваров Из СКартой Цикл
		УдалитьМатериалыСтроки(ТЧМатериалы, СтрокаТоваров.КодСтроки);
		СтрокиСостава = Состав.НайтиСтроки(Новый Структура("Продукция", СтрокаТоваров.Номенклатура));
		СтрокаТоваров.Техкарта = РегистраторПервогоУровня(СтрокиСостава);
		ПотерянныеНормы = Новый Массив;
		ДобавитьМатериалыСтроки(ТЧМатериалы, СтрокаТоваров, СтрокиСостава, СУпаковкой, ПотерянныеНормы);
		СообщитьОПотерянныхНормах(ТЧТовары, СтрокаТоваров, ПотерянныеНормы, КлючДанных);
		Результат.Заполнено = Результат.Заполнено + 1;
	КонецЦикла;
	СообщитьОСтрокахБезКарты(ТЧТовары, БезКарты, СообщатьТолькоПроизводимые, КлючДанных, Результат.БезКарты);
	СообщитьОбОшибкахРазворачивания(ТЧТовары, СОшибками, Развернутый.Ошибки, КлючДанных, Результат.СОшибками);
	Возврат Результат;

КонецФункции

// Коды строк материалов, у которых есть потомки. Такая строка - узел дерева, а не потребность: за неё
// отвечают её листья. Правило живёт здесь одно на всех потребителей - потребность (E7), списание
// автовыпуском (E9) и дерево рабочего места.
// Потомком считается только строка ТОЙ ЖЕ строки продукции: ссылка на родителя из-под другой строки
// товаров (данные загрузки, ручная правка) иначе лишала бы потребности чужой полуфабрикат, у которого
// настоящих потомков нет.
// Нулевой КодСтрокиРодителя родителем никого не делает, и это не страховка, а условие навсегда:
// КодСтроки материала не гарантирован ненулевым (ПередЗаписью выходит при ОбменДанными.Загрузка), и без
// этой оговорки строка с нулевым кодом стала бы «родителем» всех строк заказа.
//
// Параметры:
//  ТЧМатериалы - ТабличнаяЧасть, ТаблицаЗначений, ДанныеФормыКоллекция - строки с КодСтроки,
//                КодСтрокиРодителя и КодСтрокиПродукции; считается по ВСЕМ строкам, включая строки с
//                пустым материалом, - иначе у разных потребителей получились бы разные множества листьев.
//
// Возвращаемое значение:
//  Соответствие - ключ Строка (см. КлючРодителяМатериала), значение Истина. Проверять принадлежность
//                 строки так: Результат[КлючРодителяМатериала(Строка.КодСтрокиПродукции, Строка.КодСтроки)].
//
Функция КодыСтрокСПотомками(ТЧМатериалы) Экспорт

	Результат = Новый Соответствие;
	Для Каждого Материал Из ТЧМатериалы Цикл
		Если Материал.КодСтрокиРодителя <> 0 Тогда
			Результат.Вставить(КлючРодителяМатериала(Материал.КодСтрокиПродукции, Материал.КодСтрокиРодителя), Истина);
		КонецЕсли;
	КонецЦикла;
	Возврат Результат;

КонецФункции

// Ключ связи «родитель - потомок» внутри одной строки продукции.
//
// Параметры:
//  КодСтрокиПродукции - Число - код строки товаров.
//  КодСтроки          - Число - код строки материалов.
//
// Возвращаемое значение:
//  Строка - ключ для соответствия КодыСтрокСПотомками.
//
Функция КлючРодителяМатериала(КодСтрокиПродукции, КодСтроки) Экспорт

	Возврат Формат(КодСтрокиПродукции, "ЧН=0; ЧГ=0") + "|" + Формат(КодСтроки, "ЧН=0; ЧГ=0");

КонецФункции

// Материалы ПЕРВОГО УРОВНЯ по коду строки продукции: строки, у которых родитель не заполнен.
// Общая для СоставыПродукций и для проверки одинакового состава продукции в модуле объекта - там, где
// речь о составе технологической карты, а он одноуровневый. Экспортная по этой же причине.
//
// Параметры:
//  ТЧМатериалы - ТабличнаяЧасть, ТаблицаЗначений, ДанныеФормыКоллекция - материалы заказа.
//
// Возвращаемое значение:
//  Соответствие - ключ Число (код строки продукции), значение Массив строк материалов первого уровня.
//
Функция МатериалыПервогоУровняПоКодам(ТЧМатериалы) Экспорт

	Результат = Новый Соответствие;
	Для Каждого Материал Из ТЧМатериалы Цикл
		Если Материал.КодСтрокиРодителя <> 0 Тогда
			Продолжить;
		КонецЕсли;
		МатериалыКода = Результат[Материал.КодСтрокиПродукции];
		Если МатериалыКода = Неопределено Тогда
			МатериалыКода = Новый Массив;
			Результат.Вставить(Материал.КодСтрокиПродукции, МатериалыКода);
		КонецЕсли;
		МатериалыКода.Добавить(Материал);
	КонецЦикла;
	Возврат Результат;

КонецФункции

// Удаляет материалы, привязанные к строке товаров.
//
// Параметры:
//  ТЧМатериалы        - ТабличнаяЧасть, ДанныеФормыКоллекция - материалы заказа.
//  КодСтрокиПродукции - Число - код строки товаров.
//
Процедура УдалитьМатериалыСтроки(ТЧМатериалы, КодСтрокиПродукции) Экспорт

	Материалы = ТЧМатериалы.НайтиСтроки(Новый Структура("КодСтрокиПродукции", КодСтрокиПродукции));
	Для Каждого Материал Из Материалы Цикл
		ТЧМатериалы.Удалить(Материал);
	КонецЦикла;

КонецПроцедуры

// Количество материала по количеству продукции его строки: количество за единицу задано в
// упаковке материала на базовую единицу продукции, базовое количество материала - по коэффициенту
// упаковки, как у строк остальных документов. Та же формула - в форме документа на клиенте.
//
// Параметры:
//  Материал            - СтрокаТабличнойЧасти, ДанныеФормыЭлементКоллекции - строка материалов.
//  КоличествоПродукции - Число - количество строки товаров в базовых единицах.
//
Процедура ПересчитатьСтрокуМатериала(Материал, КоличествоПродукции) Экспорт

	Материал.КоличествоУпаковок = Материал.КоличествоЗаЕдиницу * КоличествоПродукции;
	РаботаСДокументамиКлиентСервер.РассчитатьКоличество(Материал);

КонецПроцедуры

// Проводится ли заказ клиента: только заказ на производство при включённом учёте производства.
// Продажа не проводится (E6), форма показывает её как записанный непроводимый документ.
//
// Параметры:
//  ВидОперации - ПеречислениеСсылка.ВидыОперацийЗаказаПокупателя - вид операции заказа.
//
// Возвращаемое значение:
//  Булево - Истина, если заказ проводится.
//
Функция ЗаказПроводится(ВидОперации) Экспорт

	Возврат ВидОперации = Перечисления.ВидыОперацийЗаказаПокупателя.Производство
		И ПолучитьФункциональнуюОпцию("Производство");

КонецФункции

// Составы продукций заказа на производство в том виде, в каком их хранит технологическая карта:
// по номенклатуре строк товаров с материалами берётся состав первой такой строки (одинаковый состав
// строк одной продукции гарантирует запись заказа), строки состава свёрнуты по материалу,
// характеристике и упаковке. Работает и с табличными частями объекта, и с выгрузкой из базы.
//
// В состав идут ТОЛЬКО материалы первого уровня (КодСтрокиРодителя = 0). Карта продукции хранится и
// сверяется одним уровнем; попади в состав узлы полуфабрикатов и их материалы - ключ состава не
// совпал бы с ключом версии карты никогда, и проведение заказа перезаписало бы карту продукции
// развёрнутым листовым составом. Уровень полуфабриката исчез бы из контура для всех прочих заказов,
// выпусков и себестоимости, молча.
//
// Параметры:
//  ТЧТовары    - ТабличнаяЧасть, ТаблицаЗначений - строки с КодСтроки, Номенклатура, Техкарта.
//  ТЧМатериалы - ТабличнаяЧасть, ТаблицаЗначений - строки с КодСтрокиПродукции, КодСтрокиРодителя,
//                Номенклатура, Характеристика, Упаковка, КоличествоЗаЕдиницу.
//  СУпаковкой  - Булево - включена опция «Использовать упаковку»; без неё упаковка очищается:
//                в документах она не используется, а карта хранит свою.
//
// Возвращаемое значение:
//  Соответствие - ключ СправочникСсылка.Номенклатура (продукция), значение Структура:
//   * Продукция - СправочникСсылка.Номенклатура - продукция.
//   * Состав    - ТаблицаЗначений - Номенклатура, Характеристика, Упаковка, Количество (на единицу).
//   * Строки    - Массив - строки товаров этой продукции с материалами.
//   * Техкарта  - ДокументСсылка.ТехнологическаяКарта - первая заполненная версия карты строк.
//
Функция СоставыПродукций(ТЧТовары, ТЧМатериалы, СУпаковкой) Экспорт

	МатериалыПоКодам = МатериалыПервогоУровняПоКодам(ТЧМатериалы);
	Результат = Новый Соответствие;
	Для Каждого СтрокаТоваров Из ТЧТовары Цикл
		Материалы = МатериалыПоКодам[СтрокаТоваров.КодСтроки];
		Если Материалы = Неопределено Или Не ЗначениеЗаполнено(СтрокаТоваров.Номенклатура) Тогда
			Продолжить;
		КонецЕсли;
		Описание = Результат[СтрокаТоваров.Номенклатура];
		Если Описание = Неопределено Тогда
			Описание = Новый Структура;
			Описание.Вставить("Продукция", СтрокаТоваров.Номенклатура);
			Описание.Вставить("Состав", НормализованныйСостав(Материалы, СУпаковкой));
			Описание.Вставить("Строки", Новый Массив);
			Описание.Вставить("Техкарта", Документы.ТехнологическаяКарта.ПустаяСсылка());
			Результат.Вставить(СтрокаТоваров.Номенклатура, Описание);
		КонецЕсли;
		Описание.Строки.Добавить(СтрокаТоваров);
		Если Не ЗначениеЗаполнено(Описание.Техкарта) И ЗначениеЗаполнено(СтрокаТоваров.Техкарта) Тогда
			Описание.Техкарта = СтрокаТоваров.Техкарта;
		КонецЕсли;
	КонецЦикла;
	Возврат Результат;

КонецФункции

// Переносит в состав без упаковки упаковку строк базовой версии карты с тем же материалом и
// характеристикой - как скрытая колонка карточки номенклатуры: без опции «Использовать упаковку»
// заказ упаковку не хранит, а новая версия карты не должна её терять.
//
// Параметры:
//  Состав       - ТаблицаЗначений - см. СоставыПродукций, колонка Состав.
//  Техкарта     - ДокументСсылка.ТехнологическаяКарта - базовая версия; пустая - ничего не переносится.
//  СоставВерсии - ТаблицаЗначений, Неопределено - уже прочитанный состав базовой версии; не задан -
//                 читается здесь. Задаётся проведением заказа: там же его читает перенос способа
//                 изготовления, и на каждую продукцию заказа приходился бы лишний запрос в транзакции.
//
Процедура ПеренестиУпаковкуКарты(Состав, Техкарта, СоставВерсии = Неопределено) Экспорт

	Если Не ЗначениеЗаполнено(Техкарта) Тогда
		Возврат;
	КонецЕсли;
	Строки = ?(СоставВерсии = Неопределено, ТехнологическиеКарты.СоставТехкартыПоРегистратору(Техкарта),
		СоставВерсии);
	Упаковки = Новый Соответствие;
	Для Каждого СтрокаКарты Из Строки Цикл
		Ключ = XMLСтрока(СтрокаКарты.Номенклатура) + "|" + XMLСтрока(СтрокаКарты.Характеристика);
		Упаковки.Вставить(Ключ, СтрокаКарты.Упаковка);
	КонецЦикла;
	Для Каждого СтрокаСостава Из Состав Цикл
		Упаковка = Упаковки[XMLСтрока(СтрокаСостава.Номенклатура) + "|" + XMLСтрока(СтрокаСостава.Характеристика)];
		Если Не ЗначениеЗаполнено(СтрокаСостава.Упаковка) И Упаковка <> Неопределено Тогда
			СтрокаСостава.Упаковка = Упаковка;
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

// Переносит в состав способ изготовления и процент потерь строк базовой версии карты с тем же материалом
// и характеристикой. Строки материалов заказа этих полей не знают, а новая версия карты, которую заводит
// проведение заказа при разошедшемся составе, не должна их обнулять: без переноса способ и процент
// сбрасывались бы у карты клиента при каждом изменении состава в заказе, молча.
// Материал, которого в базовой версии нет, значений не получает - умолчание ставит сам документ карты
// в ПередЗаписью. Пустая базовая версия (карта отменена, а в строках товаров версия не проставлена)
// означает, что переносить неоткуда: значения прежней версии не восстанавливаются, ровно как у упаковки.
//
// Параметры:
//  Состав       - ТаблицаЗначений - см. СоставыПродукций, колонка Состав.
//  Техкарта     - ДокументСсылка.ТехнологическаяКарта - базовая версия; пустая - ничего не переносится.
//  СоставВерсии - ТаблицаЗначений, Неопределено - уже прочитанный состав базовой версии; не задан -
//                 читается здесь. См. ПеренестиУпаковкуКарты.
//
Процедура ПеренестиСвойстваИзготовленияКарты(Состав, Техкарта, СоставВерсии = Неопределено) Экспорт

	Если Не ЗначениеЗаполнено(Техкарта) Тогда
		Возврат;
	КонецЕсли;
	Строки = ?(СоставВерсии = Неопределено, ТехнологическиеКарты.СоставТехкартыПоРегистратору(Техкарта),
		СоставВерсии);
	Записанные = Новый Соответствие;
	Для Каждого СтрокаКарты Из Строки Цикл
		Ключ = XMLСтрока(СтрокаКарты.Номенклатура) + "|" + XMLСтрока(СтрокаКарты.Характеристика);
		Записанные.Вставить(Ключ, СтрокаКарты);
	КонецЦикла;
	Для Каждого СтрокаСостава Из Состав Цикл
		СтрокаКарты = Записанные[
			XMLСтрока(СтрокаСостава.Номенклатура) + "|" + XMLСтрока(СтрокаСостава.Характеристика)];
		Если СтрокаКарты <> Неопределено Тогда
			СтрокаСостава.СпособИзготовления = СтрокаКарты.СпособИзготовления;
			СтрокаСостава.ПроцентПотерь = СтрокаКарты.ПроцентПотерь;
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

#КонецЕсли

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

// Очищает версию карты и материалы строк товаров, у позиций которых нет действующей карты.
// Материалы удаляются только по коду, принадлежащему одной строке: нулевой или повторный код
// не должен задеть материалы другой строки.
//
// Параметры:
//  ТЧТовары    - ТабличнаяЧасть, ДанныеФормыКоллекция - товары заказа.
//  ТЧМатериалы - ТабличнаяЧасть, ДанныеФормыКоллекция - материалы заказа.
//  БезКарты    - Массив - строки товаров без карты.
//
Процедура ОчиститьСтрокиБезКарты(ТЧТовары, ТЧМатериалы, БезКарты)

	Для Каждого СтрокаТоваров Из БезКарты Цикл
		СтрокаТоваров.Техкарта = Документы.ТехнологическаяКарта.ПустаяСсылка();
		Если СтрокаТоваров.КодСтроки = 0 Тогда
			Продолжить;
		КонецЕсли;
		Если ТЧТовары.НайтиСтроки(Новый Структура("КодСтроки", СтрокаТоваров.КодСтроки)).Количество() = 1 Тогда
			УдалитьМатериалыСтроки(ТЧМатериалы, СтрокаТоваров.КодСтроки);
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

// Добавляет материалы строки товаров по узлам развёрнутой карты, вместе с деревом.
// Узлы приходят в порядке обхода в глубину, поэтому родитель всегда создан раньше потомка и его код
// уже известен.
//
// Параметры:
//  ТЧМатериалы   - ТабличнаяЧасть, ДанныеФормыКоллекция - материалы заказа.
//  СтрокаТоваров - СтрокаТабличнойЧасти, ДанныеФормыЭлементКоллекции - строка продукции.
//  СтрокиСостава - Массив из СтрокаТаблицыЗначений - узлы одной продукции,
//                  см. ТехнологическиеКарты.РазвернутыйСостав.
//  СУпаковкой    - Булево - включена опция «Использовать упаковку».
//  ПотерянныеНормы - Массив - пополняется материалами, чья норма обрезана разрядностью количества до нуля.
//
Процедура ДобавитьМатериалыСтроки(ТЧМатериалы, СтрокаТоваров, СтрокиСостава, СУпаковкой, ПотерянныеНормы)

	// Максимальный код считается один раз на строку продукции, а не проходом по таблице на каждый материал.
	КодМатериала = РаботаСДокументамиКлиентСервер.ПолучитьСледующийКодСтроки(ТЧМатериалы);
	КодыУзлов = Новый Соответствие;
	Для Каждого СтрокаСостава Из СтрокиСостава Цикл
		Материал = ТЧМатериалы.Добавить();
		Материал.КодСтроки = КодМатериала;
		КодыУзлов.Вставить(СтрокаСостава.Индекс, КодМатериала);
		КодМатериала = КодМатериала + 1;
		Материал.КодСтрокиПродукции = СтрокаТоваров.КодСтроки;
		КодРодителя = КодыУзлов[СтрокаСостава.ИндексРодителя];
		Материал.КодСтрокиРодителя = ?(КодРодителя = Неопределено, 0, КодРодителя);
		Материал.Номенклатура = СтрокаСостава.Номенклатура;
		Материал.Характеристика = СтрокаСостава.Характеристика;
		Если СУпаковкой Тогда
			Материал.Упаковка = СтрокаСостава.Упаковка;
		КонецЕсли;
		// Количество узла уже приведено к единице продукции-владельца перемножением по цепочке.
		Материал.КоличествоЗаЕдиницу = СтрокаСостава.Количество;
		Если СтрокаСостава.Количество > 0 И Материал.КоличествоЗаЕдиницу = 0 Тогда
			// Разрядность ОпределяемыеТипы.Количество обрезала произведение по цепочке до нуля: нормы
			// вроде 0,05 на трёх уровнях дают 0,000125. Молча уйти в ноль такая строка не должна -
			// материал выпал бы и из потребности, и из списания.
			ПотерянныеНормы.Добавить(СтрокаСостава.Номенклатура);
		КонецЕсли;
		ПересчитатьСтрокуМатериала(Материал, СтрокаТоваров.Количество);
	КонецЦикла;

КонецПроцедуры

// Сообщает о материалах, чья норма по цепочке обрезана разрядностью количества до нуля.
//
// Параметры:
//  ТЧТовары        - ТабличнаяЧасть, ДанныеФормыКоллекция - товары заказа.
//  СтрокаТоваров   - СтрокаТабличнойЧасти, ДанныеФормыЭлементКоллекции - строка продукции.
//  ПотерянныеНормы - Массив из СправочникСсылка.Номенклатура - материалы с обнулённой нормой.
//  КлючДанных      - ДокументОбъект.ЗаказПокупателя, Неопределено - см. ЗаполнитьМатериалыПоТехкартам.
//
Процедура СообщитьОПотерянныхНормах(ТЧТовары, СтрокаТоваров, ПотерянныеНормы, КлючДанных)

	Если ПотерянныеНормы.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	Шаблон = НСтр("ru = 'Строка %1: норма материала ""%2"" по цепочке полуфабрикатов меньше точности количества
		|и записана нулём. Такой материал не попадёт ни в потребность, ни в списание';
		|fr = 'Ligne %1 : la norme de la matière « %2 » le long de la chaîne des semi-finis est inférieure à la
		|précision des quantités et a été enregistrée à zéro. Cette matière n''ira ni au besoin ni à la sortie';
		|en = 'Line %1: the norm of material ""%2"" along the semi-finished chain is below the quantity precision
		|and is stored as zero. Such a material goes neither into the requirement nor into the write-off';
		|es = 'Línea %1: la norma del material «%2» a lo largo de la cadena de semiacabados es inferior a la
		|precisión de cantidades y se ha guardado como cero. Ese material no entrará ni en la necesidad ni en la baja'");
	Поле = "ТЧТовары[" + Формат(ТЧТовары.Индекс(СтрокаТоваров), "ЧН=0; ЧГ=0") + "].Номенклатура";
	Для Каждого Материал Из ПотерянныеНормы Цикл
		Текст = СтрШаблон(Шаблон, СтрокаТоваров.НомерСтроки, Материал);
		Если КлючДанных = Неопределено Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст, , Поле, "Объект");
		Иначе
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст, КлючДанных, Поле);
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

// Версия карты самой продукции - регистратор первого уровня развёрнутого состава. Версии карт
// полуфабрикатов в строку товаров не попадают: проведение заказа сверяет и перезаписывает карту
// продукции, и подставленная туда карта полуфабриката перезаписала бы не тот документ.
//
// Параметры:
//  СтрокиСостава - Массив из СтрокаТаблицыЗначений - узлы одной продукции.
//
// Возвращаемое значение:
//  ДокументСсылка.ТехнологическаяКарта - версия карты продукции.
//
Функция РегистраторПервогоУровня(СтрокиСостава)

	Для Каждого СтрокаСостава Из СтрокиСостава Цикл
		Если СтрокаСостава.Уровень = 1 Тогда
			Возврат СтрокаСостава.Регистратор;
		КонецЕсли;
	КонецЦикла;
	Возврат Документы.ТехнологическаяКарта.ПустаяСсылка();

КонецФункции

// Продукция, чью карту не удалось развернуть.
//
// Параметры:
//  Ошибки - Массив из Структура - см. ТехнологическиеКарты.РазвернутыйСостав, поле Ошибки.
//
// Возвращаемое значение:
//  Соответствие - ключ СправочникСсылка.Номенклатура, значение Истина.
//
Функция ПродукцияОшибокРазворачивания(Ошибки)

	Результат = Новый Соответствие;
	Для Каждого Ошибка Из Ошибки Цикл
		Результат.Вставить(Ошибка.Продукция, Истина);
	КонецЦикла;
	Возврат Результат;

КонецФункции

// Сообщает о строках товаров, чью карту не удалось развернуть: цикл или превышение предела глубины.
// Сообщение привязывается к строке товаров - пользователь видит, какую продукцию чинить.
//
// Параметры:
//  ТЧТовары   - ТабличнаяЧасть, ДанныеФормыКоллекция - товары заказа.
//  Строки     - Массив - строки товаров с неразвёрнутой картой.
//  Ошибки     - Массив из Структура - см. ТехнологическиеКарты.РазвернутыйСостав, поле Ошибки.
//  КлючДанных - ДокументОбъект.ЗаказПокупателя, Неопределено - см. ЗаполнитьМатериалыПоТехкартам.
//  СОшибками  - Массив - пополняется номенклатурой позиций, о которых сообщено.
//
Процедура СообщитьОбОшибкахРазворачивания(ТЧТовары, Строки, Ошибки, КлючДанных, СОшибками)

	Если Строки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	ТекстыПродукции = Новый Соответствие;
	Для Каждого Ошибка Из Ошибки Цикл
		Тексты = ТекстыПродукции[Ошибка.Продукция];
		Если Тексты = Неопределено Тогда
			Тексты = Новый Массив;
			ТекстыПродукции.Вставить(Ошибка.Продукция, Тексты);
		КонецЕсли;
		Если Тексты.Найти(Ошибка.Текст) = Неопределено Тогда
			Тексты.Добавить(Ошибка.Текст);
		КонецЕсли;
	КонецЦикла;
	Шаблон = НСтр("ru = 'Строка %1: %2. Материалы строки не заполнены';
		|fr = 'Ligne %1 : %2. Les matières de la ligne ne sont pas remplies';
		|en = 'Line %1: %2. The line materials are not filled';
		|es = 'Línea %1: %2. Los materiales de la línea no se han rellenado'");
	Для Каждого СтрокаТоваров Из Строки Цикл
		Тексты = ТекстыПродукции[СтрокаТоваров.Номенклатура];
		Если Тексты = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		СОшибками.Добавить(СтрокаТоваров.Номенклатура);
		Поле = "ТЧТовары[" + Формат(ТЧТовары.Индекс(СтрокаТоваров), "ЧН=0; ЧГ=0") + "].Номенклатура";
		Для Каждого Текст Из Тексты Цикл
			Сообщение = СтрШаблон(Шаблон, СтрокаТоваров.НомерСтроки, Текст);
			Если КлючДанных = Неопределено Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Сообщение, , Поле, "Объект");
			Иначе
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Сообщение, КлючДанных, Поле);
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;

КонецПроцедуры

// Сообщает о строках товаров без действующей технологической карты.
//
// Параметры:
//  ТЧТовары           - ТабличнаяЧасть, ДанныеФормыКоллекция - товары заказа.
//  СтрокиБезКарты     - Массив - строки товаров без карты.
//  ТолькоПроизводимые - Булево - сообщать только о позициях, пополняемых производством.
//  КлючДанных         - ДокументОбъект.ЗаказПокупателя, Неопределено - см. ЗаполнитьМатериалыПоТехкартам.
//  БезКарты           - Массив - пополняется номенклатурой позиций, о которых сообщено.
//
Процедура СообщитьОСтрокахБезКарты(ТЧТовары, СтрокиБезКарты, ТолькоПроизводимые, КлючДанных, БезКарты)

	Если СтрокиБезКарты.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	Производимые = Неопределено;
	Если ТолькоПроизводимые Тогда
		Номенклатура = Новый Массив;
		Для Каждого СтрокаТоваров Из СтрокиБезКарты Цикл
			Номенклатура.Добавить(СтрокаТоваров.Номенклатура);
		КонецЦикла;
		Производимые = ПроизводимаяНоменклатура(Номенклатура);
	КонецЕсли;
	Шаблон = НСтр("ru = 'Строка %1: у ""%2"" нет действующей технологической карты, материалы строки не заполнены';
		|fr = 'Ligne %1 : « %2 » n''a pas de gamme de fabrication en vigueur, les matières de la ligne ne sont pas remplies';
		|en = 'Line %1: ""%2"" has no current production routing, the line materials are not filled';
		|es = 'Línea %1: «%2» no tiene ruta de fabricación vigente, los materiales de la línea no se han rellenado'");
	Для Каждого СтрокаТоваров Из СтрокиБезКарты Цикл
		Если Производимые <> Неопределено И Производимые[СтрокаТоваров.Номенклатура] = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		БезКарты.Добавить(СтрокаТоваров.Номенклатура);
		Текст = СтрШаблон(Шаблон, СтрокаТоваров.НомерСтроки, СтрокаТоваров.Номенклатура);
		Поле = "ТЧТовары[" + Формат(ТЧТовары.Индекс(СтрокаТоваров), "ЧН=0; ЧГ=0") + "].Номенклатура";
		Если КлючДанных = Неопределено Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст, , Поле, "Объект");
		Иначе
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст, КлючДанных, Поле);
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

// Позиции, пополняемые производством (в том числе «Оба»).
//
// Параметры:
//  Номенклатура - Массив из СправочникСсылка.Номенклатура - проверяемые позиции.
//
// Возвращаемое значение:
//  Соответствие - ключ СправочникСсылка.Номенклатура, значение Истина.
//
Функция ПроизводимаяНоменклатура(Номенклатура)

	Способы = Новый Массив;
	Способы.Добавить(Перечисления.СпособыПополненияЗапасов.Производство);
	Способы.Добавить(Перечисления.СпособыПополненияЗапасов.Оба);
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СправочникНоменклатура.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Номенклатура КАК СправочникНоменклатура
	|ГДЕ
	|	СправочникНоменклатура.Ссылка В (&Номенклатура)
	|	И СправочникНоменклатура.СпособПополнения В (&Способы)";
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("Способы", Способы);
	Результат = Новый Соответствие;
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Результат.Вставить(Выборка.Ссылка, Истина);
	КонецЦикла;
	Возврат Результат;

КонецФункции

// Строки материалов одной продукции, приведённые к строкам технологической карты.
// На вход приходят только материалы первого уровня: их отбирает МатериалыПервогоУровняПоКодам, и
// иначе состав разошёлся бы с версией карты навсегда (см. СоставыПродукций).
//
// Параметры:
//  Материалы  - Массив - строки материалов первого уровня строки товаров.
//  СУпаковкой - Булево - см. СоставыПродукций.
//
// Возвращаемое значение:
//  ТаблицаЗначений - Номенклатура, Характеристика, Упаковка, Количество.
//
Функция НормализованныйСостав(Материалы, СУпаковкой)

	Состав = Новый ТаблицаЗначений;
	Состав.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	Состав.Колонки.Добавить("Характеристика", Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры"));
	Состав.Колонки.Добавить("Упаковка", Новый ОписаниеТипов("СправочникСсылка.УпаковкиЕдиницыИзмерения"));
	Состав.Колонки.Добавить("Количество", Метаданные.ОпределяемыеТипы.Количество.Тип);
	Для Каждого Материал Из Материалы Цикл
		СтрокаСостава = Состав.Добавить();
		СтрокаСостава.Номенклатура = Материал.Номенклатура;
		СтрокаСостава.Характеристика = Материал.Характеристика;
		Если СУпаковкой Тогда
			СтрокаСостава.Упаковка = Материал.Упаковка;
		КонецЕсли;
		СтрокаСостава.Количество = Материал.КоличествоЗаЕдиницу;
	КонецЦикла;
	// Проведение карты сворачивает одинаковые строки: без свёртки здесь ключ состава заказа отличался бы
	// от записанной версии при каждом перепроведении.
	Состав.Свернуть("Номенклатура, Характеристика, Упаковка", "Количество");
	// Колонки добавляются после свёртки: Свернуть оставляет только перечисленные, а перечислять их нельзя -
	// в группировке они расщепили бы строки, в ресурсах процент бы просуммировался. У заказа этих полей нет,
	// колонки пустые; значения в них кладёт ПеренестиСвойстваИзготовленияКарты из базовой версии карты.
	Состав.Колонки.Добавить("СпособИзготовления", Новый ОписаниеТипов("ПеречислениеСсылка.СпособыИзготовления"));
	Состав.Колонки.Добавить("ПроцентПотерь", Метаданные.ОпределяемыеТипы.Процент.Тип);
	Возврат Состав;

КонецФункции

#КонецЕсли

// Печатные формы заказа покупателя: у документа их семь, поэтому названия и макеты
// заданы одним списком - его используют и команды печати, и формирование.
//
// Возвращаемое значение:
//  Массив из Структура - описания печатных форм:
//   * ИмяМакета     - Строка - идентификатор печатной формы
//   * Представление - Строка - название для пользователя
//   * ПутьКМакету   - Строка - путь макета для правки пользователем
//
Функция ОписанияПечатныхФорм()

	ПутьМакетаА4 = "Документ.РеализацияТоваровУслуг.DevisBL_A4";

	Описания = Новый Массив;
	ДобавитьОписаниеПечатнойФормы(Описания, "Заказ",
		НСтр("ru = 'Заказ покупателя'; fr = 'Commande client';
			|en = 'Customer order'; es = 'Pedido de cliente'"),
		"Документ.ЗаказПокупателя.Заказ");
	ДобавитьОписаниеПечатнойФормы(Описания, "ЗаказКлиента",
		НСтр("ru = 'Бланк заказа (A4)'; fr = 'Bon de commande (A4)';
			|en = 'Order form (A4)'; es = 'Hoja de pedido (A4)'"),
		ПутьМакетаА4);
	ДобавитьОписаниеПечатнойФормы(Описания, "КоммерческоеПредложение",
		НСтр("ru = 'Коммерческое предложение (A5)'; fr = 'Devis (A5)';
			|en = 'Quotation (A5)'; es = 'Presupuesto (A5)'"),
		"Документ.РеализацияТоваровУслуг.DevisBL");
	ДобавитьОписаниеПечатнойФормы(Описания, "КоммерческоеПредложениеА4",
		НСтр("ru = 'Коммерческое предложение (A4)'; fr = 'Devis (A4)';
			|en = 'Quotation (A4)'; es = 'Presupuesto (A4)'"),
		ПутьМакетаА4);
	ДобавитьОписаниеПечатнойФормы(Описания, "КоммерческоеПредложениеА4БезНДС",
		НСтр("ru = 'Коммерческое предложение (A4, без НДС)'; fr = 'Devis (A4, hors TVA)';
			|en = 'Quotation (A4, without VAT)'; es = 'Presupuesto (A4, sin IVA)'"),
		ПутьМакетаА4);
	ДобавитьОписаниеПечатнойФормы(Описания, "КоммерческоеПредложениеА4БезЦен",
		НСтр("ru = 'Коммерческое предложение (A4, без цен)'; fr = 'Devis (A4, sans prix)';
			|en = 'Quotation (A4, without prices)'; es = 'Presupuesto (A4, sin precios)'"),
		ПутьМакетаА4);
	ДобавитьОписаниеПечатнойФормы(Описания, "Проформа",
		НСтр("ru = 'Счёт-проформа'; fr = 'Facture proforma';
			|en = 'Proforma invoice'; es = 'Factura proforma'"),
		ПутьМакетаА4);
	Возврат Описания;

КонецФункции

// Добавляет описание печатной формы в список.
//
// Параметры:
//  Описания      - Массив - пополняемый список описаний
//  ИмяМакета     - Строка - идентификатор печатной формы
//  Представление - Строка - название для пользователя
//  ПутьКМакету   - Строка - путь макета для правки пользователем
//
Процедура ДобавитьОписаниеПечатнойФормы(Описания, ИмяМакета, Представление, ПутьКМакету)

	Описание = Новый Структура("ИмяМакета, Представление, ПутьКМакету",
		ИмяМакета, Представление, ПутьКМакету);
	Описания.Добавить(Описание);

КонецПроцедуры

// Выводит одну печатную форму документа.
//
// Параметры:
//  ИмяМакета - Строка                             - идентификатор печатной формы
//  Док       - ДокументСсылка.ЗаказПокупателя      - печатаемый документ
//  Таб       - ТабличныйДокумент                   - документ вывода
//
Процедура ВывестиПечатнуюФорму(ИмяМакета, Док, Таб)

	Если ИмяМакета = "Заказ" Тогда
		ПечатьЗаказа(Док, Таб);
	ИначеЕсли ИмяМакета = "ЗаказКлиента" Тогда
		Документы.РеализацияТоваровУслуг.PrintDevisA4(Док, Таб, "Bon de commande");
	ИначеЕсли ИмяМакета = "КоммерческоеПредложение" Тогда
		Документы.РеализацияТоваровУслуг.PrintDevisBL(Док, Таб);
	ИначеЕсли ИмяМакета = "КоммерческоеПредложениеА4" Тогда
		Документы.РеализацияТоваровУслуг.PrintDevisA4(Док, Таб);
	ИначеЕсли ИмяМакета = "КоммерческоеПредложениеА4БезНДС" Тогда
		Документы.РеализацияТоваровУслуг.PrintDevisA4HT(Док, Таб, "Devis");
	ИначеЕсли ИмяМакета = "КоммерческоеПредложениеА4БезЦен" Тогда
		Документы.РеализацияТоваровУслуг.PrintDevisA4(Док, Таб, "Devis", Истина);
	ИначеЕсли ИмяМакета = "Проформа" Тогда
		Документы.РеализацияТоваровУслуг.PrintDevisA4HT(Док, Таб, "Facture proforma");
	Иначе
		ШаблонОшибки = НСтр("ru = 'Печатная форма заказа покупателя не поддерживается: %1';
			|fr = 'Le formulaire imprimable de la commande client n''est pas pris en charge : %1';
			|en = 'The customer order print form is not supported: %1';
			|es = 'El formulario de impresión del pedido de cliente no es compatible: %1'");
		ВызватьИсключение СтрШаблон(ШаблонОшибки, ИмяМакета);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

Процедура ПечатьЗаказа(Док, Таб) Экспорт
	Макет = ПечатныеФормы.МакетПечатнойФормы("Документ.ЗаказПокупателя.Заказ");
	// Шапка
	оЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	оЗаголовок.Параметры.ТекстЗаголовка = "Commande client № " + Док.Номер + " de " + Формат(Док.Дата, "ДЛФ=DD");
	//оЗаголовок.Параметры.АдресДоставки = Док.Контрагент.Наименование;
	//оЗаголовок.Параметры.Маршрут = Справочники.Маршруты.ПолучитьПоТорговойТочке(Док.Контрагент);
	Таб.Вывести(оЗаголовок);
	
	оПоставщик = Макет.ПолучитьОбласть("Поставщик");
	КарточкаОрганизации = Справочники.Контрагенты.ПолучитьКарточку(Док.Организация, Док.Дата);
	оПоставщик.Параметры.ПредставлениеПоставщика = КарточкаОрганизации.Наименование 
	+ ", ICE " + КарточкаОрганизации.Реквизиты.ICE + ", " 
	+ КарточкаОрганизации.АдресЮридический;
	Таб.Вывести(оПоставщик);
	
	оПокупатель = Макет.ПолучитьОбласть("Покупатель");
	КарточкаПокупателя = Справочники.Контрагенты.ПолучитьКарточку(Док.Контрагент, Док.Дата);
	оПокупатель.Параметры.ПредставлениеПокупателя = КарточкаПокупателя.Наименование
	+ ", ICE " + КарточкаПокупателя.Реквизиты.ICE + ", " 
	+ КарточкаПокупателя.АдресЮридический + ", tel.: " + КарточкаПокупателя.Телефоны;
	Таб.Вывести(оПокупатель);
	
	оШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТаблицы");
	Таб.Вывести(оШапкаТаблицы);
	// Строки
	Рез = ПолучитьТоварыПоГруппировкам(Док);
	ВыбГруппа = Рез.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
	Ном = 1;
	Пока ВыбГруппа.Следующий() Цикл
		оГруппа = Макет.ПолучитьОбласть("Группа");
		оГруппа.Параметры.Наименование = ?(ЗначениеЗаполнено(ВыбГруппа.Группа), ВыбГруппа.Группа, "Autres");
		Таб.Вывести(оГруппа);
		Выб = ВыбГруппа.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока Выб.Следующий() Цикл
			оСтрока = Макет.ПолучитьОбласть("Строка");
			оСтрока.Параметры.Заполнить(Выб);
			оСтрока.Параметры.НомерСтроки = Ном;
			оСтрока.Параметры.Товар = ОбщегоНазначенияКлиентСервер.ПредставлениеНоменклатуры(Выб.Номенклатура,
				Выб.Характеристика, , Истина, Выб.НоменклатураСтрока);
			Таб.Вывести(оСтрока);
			Ном = Ном + 1;	
		КонецЦикла;	
	КонецЦикла;	
 	// Подвал
	ОбластьПодвалСчета = Макет.ПолучитьОбласть("ПодвалЗаказа");
	ОбластьПодвалСчета.Параметры.ФиоИсполнителя = Справочники.ДоговорыСКонтрагентами.ПолучитьКуратораДоговора(Док.Договор, Док.Дата).Менеджер;
	Таб.Вывести(ОбластьПодвалСчета);
	Таб.ОтображатьСетку = Ложь;
	Таб.ОтображатьЗаголовки = Ложь;
	Таб.АвтоМасштаб = Истина;
	Таб.ИспользуемоеИмяФайла = РаботаСДокументами.КраткоеПредставлениеДокумента(Док, "Commande client");
КонецПроцедуры

Функция ПолучитьТоварыПоГруппировкам(Док) Экспорт
	ТипДокумента = Док.ПолучитьОбъект().Метаданные().Имя;
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ВЫРАЗИТЬ(ТЗДопСведения.Номенклатура КАК Справочник.Номенклатура) КАК Номенклатура,
	                      |	ВЫРАЗИТЬ(ТЗДопСведения.Характеристика КАК Справочник.ХарактеристикиНоменклатуры) КАК Характеристика,
	                      |	ВЫРАЗИТЬ(ТЗДопСведения.Описание КАК СТРОКА) КАК Описание
	                      |ПОМЕСТИТЬ ВТДопСведения
	                      |ИЗ
	                      |	&ТЗДопСведения КАК ТЗДопСведения
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ТЧТовары.КодСтроки КАК КодСтроки,
	                      |	ТЧТовары.Номенклатура КАК Номенклатура,
	                      |	ТЧТовары.Характеристика КАК Характеристика,
	                      |	ТЧТовары.НоменклатураСтрока КАК НоменклатураСтрока,
	                      |	ТЧТовары.КоличествоУпаковок КАК Количество,
	                      |	ВЫБОР
	                      |		КОГДА ТЧТовары.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
	                      |			ТОГДА ТЧТовары.Номенклатура.Единица
	                      |		ИНАЧЕ ТЧТовары.Упаковка
	                      |	КОНЕЦ КАК Единица,
	                      |	ЕСТЬNULL(ВТДопСведения.Описание, """") КАК Комментарий,
	                      |	ВЫБОР
	                      |		КОГДА ТЧТовары.Номенклатура.Родитель = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	                      |			ТОГДА ТЧТовары.Номенклатура.Родитель
	                      |		КОГДА ТЧТовары.Номенклатура.Родитель.Родитель = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	                      |			ТОГДА ТЧТовары.Номенклатура.Родитель
	                      |		КОГДА ТЧТовары.Номенклатура.Родитель.Родитель.Родитель = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	                      |			ТОГДА ТЧТовары.Номенклатура.Родитель.Родитель
	                      |		КОГДА ТЧТовары.Номенклатура.Родитель.Родитель.Родитель.Родитель = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	                      |			ТОГДА ТЧТовары.Номенклатура.Родитель.Родитель.Родитель
	                      |	КОНЕЦ КАК Группа
	                      |ИЗ
	                      |	Документ."+ТипДокумента+".ТЧТовары КАК ТЧТовары
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ ВТДопСведения КАК ВТДопСведения
	                      |		ПО ТЧТовары.Номенклатура = ВТДопСведения.Номенклатура
	                      |			И ТЧТовары.Характеристика = ВТДопСведения.Характеристика
	                      |ГДЕ
	                      |	ТЧТовары.Ссылка = &Док
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	Группа,
	                      |	ТЧТовары.Номенклатура.Наименование
	                      |ИТОГИ ПО
	                      |	Группа");	
	Запрос.УстановитьПараметр("Док", Док);
	Запрос.УстановитьПараметр("ТЗДопСведения", РегистрыСведений.ДополнительныеСведенияНоменклатуры.ПолучитьПоКонтрагенту(Док.Контрагент));
	Возврат Запрос.Выполнить();
КонецФункции

#Область ОбработчикиСобытий

// Вид операции нужен представлению заказа на производство; номер и дата - стандартному представлению.
//
// Параметры:
//  Поля                 - Массив из Строка - поля, читаемые для представления
//  СтандартнаяОбработка - Булево           - сбрасывается: состав полей задаётся здесь
//
Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Поля.Добавить("Номер");
	Поля.Добавить("Дата");
	Поля.Добавить("ВидОперации");
КонецПроцедуры

// Заказ на производство называется по виду операции; у продаж и пустого вида операции представление
// стандартное, как до появления реквизита. Обработчик может выполняться на клиенте - только
// клиент-серверные функции.
//
// Параметры:
//  Данные               - Структура - значения полей из ОбработкаПолученияПолейПредставления
//  Представление        - Строка    - формируемое представление
//  СтандартнаяОбработка - Булево    - сбрасывается только для заказа на производство
//
Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	Если Данные.ВидОперации <> ПредопределенноеЗначение("Перечисление.ВидыОперацийЗаказаПокупателя.Производство") Тогда
		Возврат;
	КонецЕсли;
	СтандартнаяОбработка = Ложь;
	Шаблон = НСтр("ru = 'Заказ клиента на производство %1 от %2';
		|fr = 'Commande client en production %1 du %2';
		|en = 'Customer production order %1 dated %2';
		|es = 'Pedido de cliente para producción %1 del %2'");
	ДатаДокумента = Формат(Данные.Дата, "ДЛФ=DT");
	Представление = СтрШаблон(Шаблон, Данные.Номер, ДатаДокумента);
КонецПроцедуры

// Роли ECommerce - упрощённая форма документа. Стандартная обработка отключается только вместе
// с назначением формы: СтандартнаяОбработка = Ложь без ВыбраннаяФорма открывает пустую форму -
// так пропадал список «Заказы клиентов на производство» у пользователя с ролью ECommerce.
//
// Параметры:
//  ВидФормы                 - Строка    - вид или имя открываемой формы
//  Параметры                - Структура - параметры формы
//  ВыбраннаяФорма           - Строка    - имя подставляемой формы
//  ДополнительнаяИнформация - Структура - дополнительные сведения открытия
//  СтандартнаяОбработка     - Булево    - сбрасывается только при подмене формы
//
Процедура ОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)
	Если ВидФормы = "ФормаОбъекта" И РольДоступна("ECommerce") Тогда
		СтандартнаяОбработка = Ложь;
		ВыбраннаяФорма = "ФормаДокументаECommerce";
	КонецЕсли;
КонецПроцедуры

#КонецОбласти
